import img_maritha_1 from '../assets/img/teachers/Maritha/1.jpeg';
import img_maritha_2 from '../assets/img/teachers/Maritha/32.jpeg';
import img_maritha_3 from '../assets/img/teachers/Maritha/39.jpeg';
import img_maritha_4 from '../assets/img/teachers/Maritha/40.jpeg';
import img_levi_1 from '../assets/img/teachers/Levi/3.jpeg';
import img_levi_2 from '../assets/img/teachers/Levi/18.jpeg';
import img_levi_3 from '../assets/img/teachers/Levi/19.jpeg';
import img_levi_4 from '../assets/img/teachers/Levi/20.jpeg';
import img_levi_5 from '../assets/img/teachers/Levi/21.jpeg';
import img_dilan_1 from '../assets/img/teachers/Dilan/1.jpg';
import img_dilan_2 from '../assets/img/teachers/Dilan/2.jpg';
import img_dilan_3 from '../assets/img/teachers/Dilan/3.jpg';
import img_dilan_4 from '../assets/img/teachers/Dilan/4.jpg';
import img_kamilla_1 from '../assets/img/teachers/Kamilla/1.jpg';
import img_kamilla_2 from '../assets/img/teachers/Kamilla/2.jpg';
import img_kamilla_3 from '../assets/img/teachers/Kamilla/3.jpg';
import img_kamilla_4 from '../assets/img/teachers/Kamilla/4.jpg';

export const about_school = [
    { id: 1, title: 'Образование директора' },
    { id: 2, title: 'Наши преподаватели' },
    { id: 3, title: 'Наши награды' },
    { id: 4, title: 'Наши международные связи' },
];

export const teachers = [
    {
        name: 'Марита',
        imagePaths: [
            img_maritha_2,
            img_maritha_1,
            img_maritha_3,
            img_maritha_4,
        ],
        description: `Меня зовут Марита. Я родилась в Англии, в городе Вулверхэмптон, в семье британца и американки. Детство я провела в Оксфорде, а позже — в США, где до восьми лет жила в Бостоне. После этого мы много путешествовали по Европе — мой отец был учёным, и вся наша семья жила кочевой жизнью.

Уже несколько поколений моя семья связана с наукой, и долгое время я тоже думала, что пойду по этому пути. Экзамен Pearson Edexcel GCE открыл для меня возможность поступить в лучшие университеты мира, и я получила высшую оценку — A*.

В 16 лет я поступила в Оксфордский университет. Иногда люди удивляются, как в таком возрасте можно попасть в Оксфорд — но я не считаю себя одарённой. У меня синдром Аспергера — небольшая особенность развития, благодаря которой я могу глубоко погружаться в изучаемые темы. Это позволило мне тщательно изучать язык и многие другие предметы.

В 2020 году я окончила Оксфорд, а в 2022 получила там же степень магистра. Казалось бы, дальше должен был быть профессорский путь, но без опыта работы в Англии устроиться было непросто.

Мой преподавательский опыт начался неожиданно — в России. Я переехала в Сибирь, где начала работать в университетах и языковых школах. Очень быстро я поняла, что многим носителям языка не хватает именно методической базы. Мне захотелось разобраться в этом глубже — так я пришла к профессиональному обучению преподаванию: получила международные квалификации DELTA и TKT (оба с максимальными баллами).

Сейчас я преподаю английский язык подросткам и взрослым. Мне важно не только передать знания, но и создать атмосферу, в которой ученику интересно, комфортно и хочется говорить. Я верю, что язык — это не просто слова и правила. Это общение, история и живой процесс.`,
    },
    {
        name: 'Леви',
        imagePaths: [
            img_levi_2,
            img_levi_1,
            img_levi_3,
            img_levi_4,
            img_levi_5,
        ],
        description: `Привет! Меня зовут Леви, я преподаватель иностранных языков из Новой Зеландии. Мой отец - американец, а мать - британка, поэтому я вырос, говоря с двумя акцентами… Мне нравятся инженерное дело и компьютеры, а также я обожаю собирать автомобили. А еще мне приносят удовольствие прогулки на свежем воздухе. Сейчас я живу в Сибири, в России, а приехал я сюда, чтобы выучить русский язык. Честно говоря, это сложно, но меня не пугают трудности. В будущем я хотел бы продолжать путешествовать по миру, учиться и изучать много других языков.… почему нет?`,
    },
    {
        name: 'Дилан',
        imagePaths: [img_dilan_1, img_dilan_2, img_dilan_4, img_dilan_3],
        description: `Всем привет! 
Я Дилан... и я из Америки… по профессии я учитель английского языка, а в душе искатель приключений! Мне нравится готовить и ходить в походы... умиротворение и природа…
Интересный факт обо мне: я люблю путешествовать в Англию, чтобы навестить там друзей… Как по мне, это очень интересная страна. А еще мне нравится играть на гитаре… В данный момент я живу в Оксфорде… Приехал я сюда, чтобы провести кое-какие исследования для своей нынешней работы и увидеться с друзьями… вообще я занятой человек, но всегда нахожу возможность провести время с любимыми и дорогими мне людьми. Кстати, я не говорю по-русски, но было бы классно узнать русский сленг и развлечься.`,
    },
    {
        name: 'Камилла',
        imagePaths: [
            img_kamilla_3,
            img_kamilla_4,
            img_kamilla_2,
            img_kamilla_1,
        ],
        description: `Привет! Меня зовут Камилла, Я в преподавании уже почти 5 лет, начала работать, когда поступила на первый курс Московского государственного психолого-педагогического университета на факультет лингвистики, который окончила с отличием. Из всех возможных сфер деятельности я выбрала именно преподавание. Спросишь почему? Я обожаю английский язык и детей. Это комбо снова и снова заряжает меня энергией и невероятной силой. 
А еще я несостоявшийся музыкант (с отличием окончила музыкальную школу по классу фортепиано и гитары), люблю русскую классическую литературу и собак.
Помимо английского в моем арсенале есть итальянский и татарский языки, а еще я могу преподавать русский как иностранный. 
Надеюсь, мы с тобой подружимся, и я докажу тебе, что изучение английского языка может быть веселым и увлекательным (да-да, мы с тобой будем петь, смотреть мультфильмы и играть, все, что ты любишь!) С нетерпением жду нашего знакомства!`,
    },
];
